Autodesk.Revit.DB.OptionalFunctionalityUtils.IsPDFImportAvailable
Checks whether PDF import is available in the installed Revit.
Remarks:
PDF Import requires the presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if a PDF import is available in the installed Revit.
Since:
2020

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsAXMImportLinkAvailable
Checks whether the AXM Import/Link functionality is available in the installed Revit.
Remarks:
AXM Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the AXM Import/Link functionality is available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.OptionalFunctionalityUtils.Is3DMImportLinkAvailable
Checks whether the 3DM Import/Link functionality is available in the installed Revit.
Remarks:
3DM Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the 3DM Import/Link functionality is available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSTLImportLinkAvailable
Checks whether the STL Import/Link functionality is available in the installed Revit.
Remarks:
STL Import/Link is optional functionality that does not have to be a part of the Revit installation.
Returns:
True if the STL Import/Link functionality is available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsOBJImportLinkAvailable
Checks whether the OBJ Import/Link functionality is available in the installed Revit.
Remarks:
OBJ Import/Link is optional functionality that does not have to be a part of the Revit installation.
Returns:
True if the OBJ Import/Link functionality is available in the installed Revit.
Since:
2022.1